[
  {
    "dblp_key": "conf/icassp/ShenGD0024",
    "title": "Acoustic BPE for Speech Generation with Discrete Tokens.",
    "status": "matched",
    "arxiv_ids": [
      "2310.14580"
    ],
    "query": "ti:\"Acoustic BPE for Speech Generation with Discrete Tokens.\""
  },
  {
    "dblp_key": "journals/corr/abs-2310-14580",
    "title": "Acoustic BPE for Speech Generation with Discrete Tokens.",
    "status": "duplicate_title"
  },
  {
    "dblp_key": "conf/acl/0003GXLCLL25",
    "title": "Analyzing and Mitigating Inconsistency in Discrete Speech Tokens for Neural Codec Language Models.",
    "status": "no_match",
    "query": "ti:\"Analyzing and Mitigating Inconsistency in Discrete Speech Tokens for Neural Codec Language Models.\""
  },
  {
    "dblp_key": "journals/corr/abs-2411-08742",
    "title": "A Comparative Study of Discrete Speech Tokens for Semantic-Related Tasks with Large Language Models.",
    "status": "matched",
    "arxiv_ids": [
      "2411.08742"
    ],
    "query": "ti:\"A Comparative Study of Discrete Speech Tokens for Semantic-Related Tasks with Large Language Models.\""
  },
  {
    "dblp_key": "conf/interspeech/OndaIFSM25",
    "title": "Discrete Tokens Exhibit Interlanguage Speech Intelligibility Benefit: an Analytical Study Towards Accent-robust ASR Only with Native Speech Data.",
    "status": "matched",
    "arxiv_ids": [
      "2505.16182"
    ],
    "query": "ti:\"Discrete Tokens Exhibit Interlanguage Speech Intelligibility Benefit: an Analytical Study Towards Accent-robust ASR Only with Native Speech Data.\""
  },
  {
    "dblp_key": "journals/corr/abs-2505-16182",
    "title": "Discrete Tokens Exhibit Interlanguage Speech Intelligibility Benefit: an Analytical Study Towards Accent-robust ASR Only with Native Speech Data.",
    "status": "duplicate_title"
  },
  {
    "dblp_key": "journals/corr/abs-2508-17863",
    "title": "Speech Discrete Tokens or Continuous Features? A Comparative Analysis for Spoken Language Understanding in SpeechLLMs.",
    "status": "matched",
    "arxiv_ids": [
      "2508.17863"
    ],
    "query": "ti:\"Speech Discrete Tokens or Continuous Features? A Comparative Analysis for Spoken Language Understanding in SpeechLLMs.\""
  },
  {
    "dblp_key": "journals/corr/abs-2509-09631",
    "title": "DiFlow-TTS: Discrete Flow Matching with Factorized Speech Tokens for Low-Latency Zero-Shot Text-To-Speech.",
    "status": "matched",
    "arxiv_ids": [
      "2509.09631"
    ],
    "query": "ti:\"DiFlow-TTS: Discrete Flow Matching with Factorized Speech Tokens for Low-Latency Zero-Shot Text-To-Speech.\""
  },
  {
    "dblp_key": "conf/interspeech/ErdoganWCBTZH23",
    "title": "TokenSplit: Using Discrete Speech Representations for Direct, Refined, and Transcript-Conditioned Speech Separation and Recognition.",
    "status": "matched",
    "arxiv_ids": [
      "2308.10415"
    ],
    "query": "ti:\"TokenSplit: Using Discrete Speech Representations for Direct, Refined, and Transcript-Conditioned Speech Separation and Recognition.\""
  },
  {
    "dblp_key": "journals/corr/abs-2308-10415",
    "title": "TokenSplit: Using Discrete Speech Representations for Direct, Refined, and Transcript-Conditioned Speech Separation and Recognition.",
    "status": "duplicate_title"
  },
  {
    "dblp_key": "conf/icassp/WangXGHXCLDL25",
    "title": "Phone-purity Guided Discrete Tokens for Dysarthric Speech Recognition.",
    "status": "matched",
    "arxiv_ids": [
      "2501.04379"
    ],
    "query": "ti:\"Phone-purity Guided Discrete Tokens for Dysarthric Speech Recognition.\""
  },
  {
    "dblp_key": "journals/corr/abs-2501-04379",
    "title": "Phone-purity Guided Discrete Tokens for Dysarthric Speech Recognition.",
    "status": "duplicate_title"
  },
  {
    "dblp_key": "journals/corr/abs-2502-06490",
    "title": "Recent Advances in Discrete Speech Tokens: A Review.",
    "status": "matched",
    "arxiv_ids": [
      "2502.06490"
    ],
    "query": "ti:\"Recent Advances in Discrete Speech Tokens: A Review.\""
  },
  {
    "dblp_key": "journals/corr/abs-2506-16738",
    "title": "LM-SPT: LM-Aligned Semantic Distillation for Speech Tokenization.",
    "status": "matched",
    "arxiv_ids": [
      "2506.16738"
    ],
    "query": "ti:\"LM-SPT: LM-Aligned Semantic Distillation for Speech Tokenization.\""
  },
  {
    "dblp_key": "conf/eusipco/RouxRWD24",
    "title": "A Comprehensive Analysis of Tokenization and Self-Supervised Learning in End-to-End Automatic Speech Recognition Applied on French Language.",
    "status": "no_match",
    "query": "ti:\"A Comprehensive Analysis of Tokenization and Self-Supervised Learning in End-to-End Automatic Speech Recognition Applied on French Language.\""
  },
  {
    "dblp_key": "journals/corr/abs-2509-04685",
    "title": "Say More with Less: Variable-Frame-Rate Speech Tokenization via Adaptive Clustering and Implicit Duration Coding.",
    "status": "matched",
    "arxiv_ids": [
      "2509.04685"
    ],
    "query": "ti:\"Say More with Less: Variable-Frame-Rate Speech Tokenization via Adaptive Clustering and Implicit Duration Coding.\""
  },
  {
    "dblp_key": "journals/corr/abs-2310-07246",
    "title": "Vec-Tok Speech: speech vectorization and tokenization for neural speech generation.",
    "status": "matched",
    "arxiv_ids": [
      "2310.07246"
    ],
    "query": "ti:\"Vec-Tok Speech: speech vectorization and tokenization for neural speech generation.\""
  },
  {
    "dblp_key": "conf/interspeech/KandoMT25",
    "title": "Exploring the Effect of Segmentation and Vocabulary Size on Speech Tokenization for Speech Language Models.",
    "status": "matched",
    "arxiv_ids": [
      "2505.17446"
    ],
    "query": "ti:\"Exploring the Effect of Segmentation and Vocabulary Size on Speech Tokenization for Speech Language Models.\""
  },
  {
    "dblp_key": "journals/corr/abs-2505-17446",
    "title": "Exploring the Effect of Segmentation and Vocabulary Size on Speech Tokenization for Speech Language Models.",
    "status": "duplicate_title"
  },
  {
    "dblp_key": "conf/acl/HuangMK24",
    "title": "RepCodec: A Speech Representation Codec for Speech Tokenization.",
    "status": "matched",
    "arxiv_ids": [
      "2309.00169"
    ],
    "query": "ti:\"RepCodec: A Speech Representation Codec for Speech Tokenization.\""
  },
  {
    "dblp_key": "conf/interspeech/MessicaA24",
    "title": "NAST: Noise Aware Speech Tokenization for Speech Language Models.",
    "status": "matched",
    "arxiv_ids": [
      "2406.11037"
    ],
    "query": "ti:\"NAST: Noise Aware Speech Tokenization for Speech Language Models.\""
  },
  {
    "dblp_key": "journals/corr/abs-2406-11037",
    "title": "NAST: Noise Aware Speech Tokenization for Speech Language Models.",
    "status": "duplicate_title"
  },
  {
    "dblp_key": "journals/corr/abs-2309-00169",
    "title": "RepCodec: A Speech Representation Codec for Speech Tokenization.",
    "status": "duplicate_title"
  },
  {
    "dblp_key": "journals/speech/AsoTTS20",
    "title": "Acoustic model-based subword tokenization and prosodic-context extraction without language knowledge for text-to-speech synthesis.",
    "status": "no_match",
    "query": "ti:\"Acoustic model-based subword tokenization and prosodic-context extraction without language knowledge for text-to-speech synthesis.\""
  },
  {
    "dblp_key": "conf/icassp/SinghD025",
    "title": "BEST-STD: Bidirectional Mamba-Enhanced Speech Tokenization for Spoken Term Detection.",
    "status": "matched",
    "arxiv_ids": [
      "2411.14100"
    ],
    "query": "ti:\"BEST-STD: Bidirectional Mamba-Enhanced Speech Tokenization for Spoken Term Detection.\""
  },
  {
    "dblp_key": "conf/interspeech/KhuranaKLBNGZHH25",
    "title": "Factorized RVQ-GAN For Disentangled Speech Tokenization.",
    "status": "matched",
    "arxiv_ids": [
      "2506.15456"
    ],
    "query": "ti:\"Factorized RVQ-GAN For Disentangled Speech Tokenization.\""
  },
  {
    "dblp_key": "conf/icassp/WeiCLL17",
    "title": "Personalized acoustic modeling by weakly supervised multi-task deep learning using acoustic tokens discovered from unlabeled data.",
    "status": "matched",
    "arxiv_ids": [
      "1706.07793"
    ],
    "query": "ti:\"Personalized acoustic modeling by weakly supervised multi-task deep learning using acoustic tokens discovered from unlabeled data.\""
  },
  {
    "dblp_key": "journals/corr/WeiCLL17",
    "title": "Personalized Acoustic Modeling by Weakly Supervised Multi-Task Deep Learning using Acoustic Tokens Discovered from Unlabeled Data.",
    "status": "duplicate_title"
  },
  {
    "dblp_key": "journals/corr/abs-2507-12825",
    "title": "Autoregressive Speech Enhancement via Acoustic Tokens.",
    "status": "matched",
    "arxiv_ids": [
      "2507.12825"
    ],
    "query": "ti:\"Autoregressive Speech Enhancement via Acoustic Tokens.\""
  },
  {
    "dblp_key": "journals/corr/abs-2509-14882",
    "title": "Llama-Mimi: Speech Language Models with Interleaved Semantic and Acoustic Tokens.",
    "status": "matched",
    "arxiv_ids": [
      "2509.14882"
    ],
    "query": "ti:\"Llama-Mimi: Speech Language Models with Interleaved Semantic and Acoustic Tokens.\""
  },
  {
    "dblp_key": "journals/taslp/FengZM24",
    "title": "Masking Hierarchical Tokens for Underwater Acoustic Target Recognition With Self-Supervised Learning.",
    "status": "no_match",
    "query": "ti:\"Masking Hierarchical Tokens for Underwater Acoustic Target Recognition With Self-Supervised Learning.\""
  },
  {
    "dblp_key": "conf/sigtype/SanPAHKAJ24",
    "title": "Predicting positive transfer for improved low-resource speech recognition using acoustic pseudo-tokens.",
    "status": "matched",
    "arxiv_ids": [
      "2402.02302"
    ],
    "query": "ti:\"Predicting positive transfer for improved low-resource speech recognition using acoustic pseudo-tokens.\""
  },
  {
    "dblp_key": "journals/corr/abs-2402-02302",
    "title": "Predicting positive transfer for improved low-resource speech recognition using acoustic pseudo-tokens.",
    "status": "duplicate_title"
  },
  {
    "dblp_key": "conf/icdip/ZhouWLWT23",
    "title": "UATR-MSG-Transformer: A Deep Learning Network for Underwater Acoustic Target Recognition Based on Spectrogram Feature Fusion and Transformer with Messenger Tokens.",
    "status": "no_match",
    "query": "ti:\"UATR-MSG-Transformer: A Deep Learning Network for Underwater Acoustic Target Recognition Based on Spectrogram Feature Fusion and Transformer with Messenger Tokens.\""
  },
  {
    "dblp_key": "journals/bdcc/RodionovLKOGP25",
    "title": "Integration of Associative Tokens into Thematic Hyperspace: A Method for Determining Semantically Significant Clusters in Dynamic Text Streams.",
    "status": "no_match",
    "query": "ti:\"Integration of Associative Tokens into Thematic Hyperspace: A Method for Determining Semantically Significant Clusters in Dynamic Text Streams.\""
  },
  {
    "dblp_key": "journals/spl/PengXXXL25",
    "title": "Large Model Empowered Multi-Modal Semantic Communication With Selective Tokens for Training.",
    "status": "no_match",
    "query": "ti:\"Large Model Empowered Multi-Modal Semantic Communication With Selective Tokens for Training.\""
  },
  {
    "dblp_key": "journals/tacl/HaslettC25",
    "title": "How Much Semantic Information is Available in Large Language Model Tokens?",
    "status": "no_match",
    "query": "ti:\"How Much Semantic Information is Available in Large Language Model Tokens?\""
  },
  {
    "dblp_key": "conf/cvpr/KalibhatKNZSSKF25",
    "title": "Understanding the Effect of using Semantically Meaningful Tokens for Visual Representation Learning.",
    "status": "matched",
    "arxiv_ids": [
      "2405.16401"
    ],
    "query": "ti:\"Understanding the Effect of using Semantically Meaningful Tokens for Visual Representation Learning.\""
  },
  {
    "dblp_key": "conf/icassp/ZhaoMLXXZAGLF25",
    "title": "Textless Streaming Speech-to-Speech Translation using Semantic Speech Tokens.",
    "status": "matched",
    "arxiv_ids": [
      "2410.03298"
    ],
    "query": "ti:\"Textless Streaming Speech-to-Speech Translation using Semantic Speech Tokens.\""
  },
  {
    "dblp_key": "journals/corr/abs-2505-13775",
    "title": "Beyond Semantics: The Unreasonable Effectiveness of Reasonless Intermediate Tokens.",
    "status": "matched",
    "arxiv_ids": [
      "2505.13775"
    ],
    "query": "ti:\"Beyond Semantics: The Unreasonable Effectiveness of Reasonless Intermediate Tokens.\""
  },
  {
    "dblp_key": "journals/corr/abs-2506-19028",
    "title": "Quantifying Fairness in LLMs Beyond Tokens: A Semantic and Statistical Perspective.",
    "status": "matched",
    "arxiv_ids": [
      "2506.19028"
    ],
    "query": "ti:\"Quantifying Fairness in LLMs Beyond Tokens: A Semantic and Statistical Perspective.\""
  },
  {
    "dblp_key": "journals/corr/abs-2508-02401",
    "title": "CompressKV: Semantic Retrieval Heads Know What Tokens are Not Important Before Generation.",
    "status": "matched",
    "arxiv_ids": [
      "2508.02401"
    ],
    "query": "ti:\"CompressKV: Semantic Retrieval Heads Know What Tokens are Not Important Before Generation.\""
  },
  {
    "dblp_key": "journals/corr/abs-2508-03695",
    "title": "Trokens: Semantic-Aware Relational Trajectory Tokens for Few-Shot Action Recognition.",
    "status": "matched",
    "arxiv_ids": [
      "2508.03695"
    ],
    "query": "ti:\"Trokens: Semantic-Aware Relational Trajectory Tokens for Few-Shot Action Recognition.\""
  }
]